app/Http/Controllers/PostController.php

    public function index()
    {
        $user_id = auth()->user()->id;
        $posts = Post::where('user_id', $user_id)->get();
        $categories = Category::all();
---
select * from `posts` where `user_id` = 1
select * from `categories`

    public function create()
    {
        $categories = Category::all();
---
select * from `categories`

    public function edit(Post $post)
    {
        $this->authorize('update', $post);
        $categories = Category::all();
---
select * from `categories`